Revit 2027 API
SchedulableField.FieldType Property
 The type of data displayed by the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldType FieldType { get; set; }
Public Property FieldType As ScheduleFieldType
	Get
	Set
public:
property ScheduleFieldType FieldType {
	ScheduleFieldType get ();
	void set (ScheduleFieldType value);
}
member FieldType : ScheduleFieldType with get, set
Property Value
ScheduleFieldType
 See ScheduleFieldType for details.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: fieldType is not a schedulable field type
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace